<template>
    <div>
        <h1 class="text-3xl text-center mb-7 leading-8">นโยบายความเป็นส่วนตัว <br />(Privacy Policy)</h1>
        <p class="mb-5">
        Smart Seaman Application ให้ความสำคัญกับการคุ้มครองข้อมูลส่วนบุคคล การล่วงละเมิดสิทธิในข้อมูลส่วนบุคคล การควบคุมการใช้ข้อมูล และการป้องกันการรั่วไหลของข้อมูลส่วนบุคคล จึงได้จัดทำนโยบายคุ้มครองข้อมูลส่วนบุคคลตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.2562 โปรดอ่านและทำความเข้าใจนโยบายความเป็นส่วนตัวนี้อย่างละเอียด การที่คุณได้ติดตั้งและเข้าใช้งาน Smart Seaman Application ถือว่าคุณได้ตกลงยอมรับข้อกำหนด
        <br/><br/>เราจะใช้ข้อมูลที่คุณลงทะเบียนเพื่อให้คุณสามารถใช้บริการต่างๆใน Smart Seaman Application โดยเราเคารพสิทธิส่วนบุคคลและให้ความสำคัญต่อการคุ้มครองข้อมูลส่วนบุคคลของผู้ใช้งานทุกคน
        <br/><br/>ทั้งนี้ Smart Seaman Application มีนโยบายในการพัฒนาและปรับปรุงการให้บริการให้มีความทันสมัย มีประสิทธิภาพและเป็นไปตามหลักธรรมาภิบาลและกฎหมายที่เกี่ยวข้องอยู่เสมอ จึงอาจมีการปรับปรุงแก้ไขนโยบายความเป็นส่วนตัวนี้เป็นครั้งคราว จึงขอให้คุณตรวจสอบนโยบายนี้เป็นระยะๆ เพื่อที่คุณจะได้ทราบนโยบายความเป็นส่วนตัวล่าสุดของเรา
        </p>

        <div class="content">
            <ul>
                <li>
                <h2>การเก็บรวบรวมข้อมูลส่วนบุคคลของคุณจากแหล่งใดบ้าง</h2>
                <p>
                  เราจะเก็บรวบรวมข้อมูลส่วนบุคคลที่ได้รับโดยตรงจากคุณ เช่น ข้อมูลที่คุณกรอกขณะลงทะเบียนสมัครใช้บริการ ข้อมูลบัญชีผู้ใช้งาน (Account) หรือข้อมูลที่คุณได้แก้ไขปรับปรุงในข้อมูลบัญชีผู้ใช้งาน (Account)
                </p>
                </li>
                <li>
                <h2>
                  ข้อมูลส่วนบุคคลที่เก็บรวบรวม
                </h2>
                <p>
                  ข้อมูลเกี่ยวกับบุคคล เช่น ชื่อ-นามสกุล เพศ วันเดือนปีเกิด อายุ หมายเลขโทรศัพท์ อีเมล เป็นต้น ข้อมูลเกี่ยวกับใบประกาศนียบัตรหรือเอกสาร
                </p>
                </li>
                <li>
                <h2>ระยะเวลาในการเก็บรวบรวมข้อมูลส่วนบุคคล</h2>
                <p>
                    Smart Seaman Application จะเก็บรักษาข้อมูลส่วนบุคคลของคุณไว้เป็นระยะเวลาเท่าที่จำเป็น ระหว่างที่คุณเป็นสมาชิก เพื่อการดำเนินการตามวัตถุประสงค์ที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้ให้เสร็จสิ้น เว้นแต่กรณีที่กฎหมายกำหนดหรืออนุญาตให้เก็บรักษาข้อมูลไว้นานกว่า ซึ่งอาจมีกำหนดประมาณ 5 – 10 ปี หรือเกินกว่านั้นเท่าที่จำเป็น เช่น ตามอายุความที่กฎหมายกำหนดสำหรับเรื่องที่เกี่ยวข้อง เพื่อการดำเนินคดี หรือเพื่อการตรวจสอบของหน่วยงานที่กำกับดูแล
                </p>
                </li>
                <li>
                <h2>วัตถุประสงค์ในการเก็บรวบรวมข้อมูลส่วนบุคคล</h2>
                <p>
                    เพื่อที่คุณจะได้รับบริการที่ตรงตามวัตถุประสงค์ของคุณในระบบ Smart Seaman Application
                </p>
                </li>
                <li>
                <h2>การเปิดเผยข้อมูลส่วนบุคคล</h2>
                <p>Smart Seaman Application จะไม่เปิดเผยข้อมูลส่วนบุคคลต่อบุคคลใดโดยไม่ได้รับความยินยอมจากคุณก่อน อย่างไรก็ดี คุณรับทราบและยินยอมว่า เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณให้แก่ผู้อื่นภายใต้ความยินยอมของคุณหรือตามที่กฎหมายอนุญาตให้เปิดเผยได้ เช่น การบริหารจัดการภายในองค์กรหรือบริษัท เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณภายในองค์กรหรือบริษัทเท่าที่จำเป็นเพื่อปรับปรุงการบริการของเรา เพื่อประโยชน์ของคุณและผู้อื่นมากขึ้น การบังคับใช้กฎหมาย การเปิดเผยข้อมูลนั้นเป็นไปตามที่กฎหมายอนุญาต หรือเป็นไปตามที่กฎหมายกำหนด เราจะเปิดเผยข้อมูลส่วนบุคคลของคุณเท่าที่จำเป็น ให้แก่หน่วยงานราชการหรือเจ้าหน้าที่ของรัฐที่ใช้อำนาจหน้าที่ตามกฎหมาย</p>
                </li>
                <li>
                <h2>สิทธิของคุณในการจัดการกับข้อมูลส่วนบุคคล</h2>
                <p>
                    สิทธิในการแก้ไขหรือลบข้อมูลส่วนบุคคล คุณสามารถแก้ไขหรือลบข้อมูลส่วนบุคคลของคุณได้ตลอดเวลา
                </p>
                </li>
                <li>
                <h2>การติดต่อเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล</h2>
                <p>
                    หากคุณมีข้อเสนอแนะ มีข้อสงสัย หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้ และ/หรือเปิดเผยข้อมูลส่วนบุคคลของคุณ รวมถึงสิทธิ์ของคุณในฐานะเจ้าของข้อมูลส่วนบุคคลตามนโยบายฉบับนี้ หรือกรณีที่พบว่ามีการใช้ข้อมูลส่วนบุคคลของคุณไปในทางที่ไม่ชอบ คุณสามารถติดต่อผ่านทางช่องทางอีเมล contact.smartseaman@gmail.com
                </p>
                </li>
            </ul>
        </div>
    </div>
</template>

<script>
export default {};
</script>

<style lang="scss" scoped>
    h1{
        font-weight: 600;
        color: #fff;
        font-size: 22px;
    }

    p{
        font-size: 16px !important;
        margin-bottom: 20px;
    }

    h2{
        font-size: 18px !important;
        margin-bottom: 10px;
        font-weight: 600;
        color: #fff;
    }
</style>